meatpiHQ/wican-fw/sdkconfig.defaults
# This file was generated using idf.py save-defconfig or menuconfig [D] key. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 6.0.2 Project Minimal Configuration
#
# default:
CONFIG_IDF_TARGET="esp32s3"
CONFIG_APP_RETRIEVE_LEN_ELF_SHA=16
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="wican_pro_partitions_table.csv"
CONFIG_COMPILER_ASSERT_NDEBUG_EVALUATE=y
CONFIG_COMPILER_CXX_EXCEPTIONS=y
CONFIG_COMPILER_DISABLE_DEFAULT_ERRORS=y
CONFIG_COMPILER_ORPHAN_SECTIONS_PLACE=y
CONFIG_BT_ENABLED=y
CONFIG_BT_BTU_TASK_STACK_SIZE=4096
CONFIG_BT_ALLOCATION_FROM_SPIRAM_FIRST=y
CONFIG_BT_BLE_50_FEATURES_SUPPORTED=n
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y
CONFIG_BT_CTRL_BLE_MAX_ACT=10
CONFIG_BT_CTRL_HW_CCA_VAL=20
CONFIG_ESP_TLS_CLIENT_SESSION_TICKETS=y
CONFIG_HTTPD_MAX_URI_LEN=1024
CONFIG_HTTPD_WS_SUPPORT=y
CONFIG_LIBC_NEWLIB=y
CONFIG_PM_SLEEP_FUNC_IN_IRAM=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MEMTEST=n
# 128 -> 32 (2026-07-07): internal RAM hit ~1.7 KB free after the
# data_logger/vpn/sleep additions; small mallocs (registries, cJSON
# nodes) now go PSRAM-first, recovering internal heap for WiFi + DMA
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=32
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_ALLOW_NOINIT_SEG_EXTERNAL_MEMORY=y
CONFIG_ESP_CONSOLE_UART_CUSTOM=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=2000000
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_IPC_TASK_STACK_SIZE=1536
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=40
CONFIG_ESP_WIFI_TX_BA_WIN=32
CONFIG_ESP_WIFI_RX_BA_WIN=16
CONFIG_ESP_WIFI_GMAC_SUPPORT=n
CONFIG_FATFS_USE_DYN_BUFFERS=n
# unlink-while-open corrupts FATFS (orphaned cluster chains) — with the
# data_logger holding its active files open, a /api/fs delete of the
# CURRENT log must fail (FR_LOCKED), not corrupt the card (2026-07-09)
CONFIG_FATFS_FS_LOCK=8
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=3072
CONFIG_FREERTOS_IN_IRAM=y
CONFIG_LOG_COLORS=y
CONFIG_LWIP_MAX_SOCKETS=18
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=20480
CONFIG_LWIP_TCP_WND_DEFAULT=20480
CONFIG_LWIP_TCP_RECVMBOX_SIZE=64
CONFIG_LWIP_PPP_SUPPORT=y
CONFIG_LWIP_SNTP_MAX_SERVERS=2
CONFIG_LWIP_HOOK_IP6_INPUT_NONE=y
CONFIG_MBEDTLS_THREADING_C=n
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_MBEDTLS_SSL_PROTO_TLS1_3=y
CONFIG_MBEDTLS_ECP_FIXED_POINT_OPTIM=y
CONFIG_MBEDTLS_LARGE_KEY_SOFTWARE_MPI=n
CONFIG_NVS_ALLOCATE_CACHE_IN_SPIRAM=y
CONFIG_ESP_PROTOCOMM_SUPPORT_SECURITY_VERSION_0=y
CONFIG_ESP_PROTOCOMM_SUPPORT_SECURITY_VERSION_1=y
CONFIG_VFS_SUPPORT_TERMIOS=y

# Task observability: uxTaskGetSystemState for /api/status/tasks stack
# high-water reporting (dev_status_manager, Architecture 12b)
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
# persist BLE bonds to NVS so a paired phone reconnects without
# re-entering the passkey (survives reboot/power-cycle) 
CONFIG_BT_NIMBLE_NVS_PERSIST=y
# task monitoring (dev_status /api/status/tasks + `system -t`): per-task
# runtime counters (CPU%%), 64-bit so the us counter never wraps, and the
# core-affinity field in TaskStatus_t. MEASURED COST (A/B 2026-07-08):
# ~1.1 KB internal RAM total = 828 B static + 8 B/task TCB counters
# (~330 B at 41 tasks), plus ~1 us of esp_timer read per context switch
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_RUN_TIME_COUNTER_TYPE_U64=y
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y

# WS handshake gating: IDF v6 does NOT call the uri handler at handshake
# (websocket_manager gates max_clients + registers clients in the pre-cb)
CONFIG_HTTPD_WS_PRE_HANDSHAKE_CB_SUPPORT=y

# mdns task + buffers in PSRAM (internal-RAM reclaim, 2026-07-05)
CONFIG_MDNS_TASK_CREATE_FROM_SPIRAM=y
CONFIG_MDNS_MEMORY_ALLOC_SPIRAM=y

# BT host stack A/B (2026-07-05): NimBLE + PSRAM host allocs is the
# tested state (BLE start 41.6K internal vs Bluedroid 58.4K; -183K flash;
# same on-air contract incl. byte-exact Device Info). To switch back to
# Bluedroid: set CONFIG_BT_BLUEDROID_ENABLED=y and drop the two lines
# below (ble_manager picks its GATT backend from this choice).
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_EXTERNAL=y

# sys_evt stack: the v6.0.2 default (2304) overflowed live in the WiFi HIL
# app's got-IP handler path (2026-07-06) — pin the classic 4608. Main's
# margin at 2304 was untested luck; +2.3 K internal buys the safety.
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4608

# littlefs on SD-card support (data_logger backend option, 2026-07-07):
# compile-time only — nothing mounts SD-littlefs unless configured.
CONFIG_LITTLEFS_SDMMC_SUPPORT=y

# CherryUSB host (vendored meatpiHQ fork, components/cherryusb) — the
# USB track (usb_eth_host/usb_host_manager). Net-class buffers are the
# heap-backed shared pool (allocated only while an adapter is attached).
CONFIG_CHERRYUSB=y
CONFIG_CHERRYUSB_HOST=y
CONFIG_CHERRYUSB_HOST_CDC_ACM=y
CONFIG_CHERRYUSB_HOST_CDC_ECM=y
CONFIG_CHERRYUSB_HOST_CDC_RNDIS=y
CONFIG_CHERRYUSB_HOST_CDC_NCM=y
CONFIG_CHERRYUSB_HOST_ASIX=y
# RTL8152 disabled (meatpi 2026-07-13): needs a 32 KB internal-DMA RX pool; ASIX is the supported adapter
# CONFIG_CHERRYUSB_HOST_RTL8152 is not set

# microlink/Tailscale Noise protocol (ts2021) uses mbedtls ChaChaPoly +
# ChaCha20 for the control-plane crypto — off by default in mbedtls 4.
CONFIG_MBEDTLS_CHACHA20_C=y
CONFIG_MBEDTLS_CHACHAPOLY_C=y

# TWAI ISR in IRAM (2026-07-10): with a flash-resident ISR, EVERY
# internal-flash operation (NVS commit, littlefs write — cache-off
# window) masks the CAN interrupt and the ~64-byte hardware RX FIFO
# silently overruns => wire frames vanish with all software counters
# clean (the datalog leg1 first-3-frames heisen-loss). can_core also
# sets ESP_INTR_FLAG_IRAM so the interrupt STAYS ENABLED during
# cache-off.
CONFIG_TWAI_ISR_IN_IRAM_LEGACY=y
# Same lesson for the NEW esp_driver_twai node API (can_core ported
# 2026-07-21): the node ISR + our on_rx_done/on_state_change callbacks
# must stay cache-safe or flash ops eat frames again.
CONFIG_TWAI_ISR_CACHE_SAFE=y

# Flash-op counters (2026-07-19): the wear/abuse tripwire — dev_status
# exposes them, the boot report prints them, the bench asserts budgets
CONFIG_SPI_FLASH_ENABLE_COUNTERS=y

# CAN ISR core (2026-07-21 full-load A/B, n=3): raw receive saturates
# 500k line rate on EITHER core; one core-0 run showed 2.2% ISR-queue
# loss under monitor+storm but the repeat showed ZERO (run variance,
# possibly radio/WiFi-contention dependent) -> no reproducible benefit,
# default stays 0. The WICAN_CAN_ISR_CORE shim remains for slot-pool
# headroom / future retest (flip + rebuild to move ISR+rx to core 1).
CONFIG_WICAN_CAN_ISR_CORE=0
